# FabDbOpenJobConn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabDbOpenJobConn Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Fabrication job imported had bad connectivity
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabDbOpenJobConn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabDbOpenJobConn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabDbOpenJobConn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace